In [1]:
import numpy as np
import pandas as pd

# Working with missing data

http://pandas.pydata.org/pandas-docs/stable/missing_data.html

## Missing data basics 

"Missing" = Not available for some reason. In Python/pandas it's `NaN`. Commonly introduced because of reindexing.

In [2]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])

In [3]:
df

,one,two,three
a,0.580965,-1.349902,-0.368215
c,0.413943,1.171888,0.859315
e,0.995922,0.000268,0.810805
f,0.793222,0.977586,1.770551
h,0.525656,-1.056565,1.835253

In [6]:
# Add a column by broadcasting

df['four'] = 'bar'
df['five'] = df.one > 0

In [7]:
df

,one,two,three,four,five
a,0.580965,-1.349902,-0.368215,bar,True
c,0.413943,1.171888,0.859315,bar,True
e,0.995922,0.000268,0.810805,bar,True
f,0.793222,0.977586,1.770551,bar,True
h,0.525656,-1.056565,1.835253,bar,True

In [8]:
# Reindexing, adding three new indices

df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

In [9]:
df2

,one,two,three,four,five
a,0.580965,-1.349902,-0.368215,bar,True
b,NaN,NaN,NaN,NaN,NaN
c,0.413943,1.171888,0.859315,bar,True
d,NaN,NaN,NaN,NaN,NaN
e,0.995922,0.000268,0.810805,bar,True
f,0.793222,0.977586,1.770551,bar,True
g,NaN,NaN,NaN,NaN,NaN
h,0.525656,-1.056565,1.835253,bar,True

For finding the missing values: `isna` and `notna` functions.

In [13]:
df2.one

a    0.580965
b         NaN
c    0.413943
d         NaN
e    0.995922
f    0.793222
g         NaN
h    0.525656
Name: one, dtype: float64

In [14]:
pd.isna(df2.one)

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [15]:
pd.notna(df2.one)

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [17]:
# Or as a method

df2['one'].isna()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [18]:
# Method chaining

df2.one.notna()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

## DateTimes

In [19]:
df2 = df.copy()

In [20]:
df2['date'] = pd.Timestamp('20171222')
df2

,one,two,three,four,five,date
a,0.580965,-1.349902,-0.368215,bar,True,2017-12-22
c,0.413943,1.171888,0.859315,bar,True,2017-12-22
e,0.995922,0.000268,0.810805,bar,True,2017-12-22
f,0.793222,0.977586,1.770551,bar,True,2017-12-22
h,0.525656,-1.056565,1.835253,bar,True,2017-12-22

In [24]:
# Missing time/date values are denoted with NaT 
# Interoperates with NaN

df2.loc[['a','c','h'],['one','date']] = np.nan
df2

,one,two,three,four,five,date
a,NaN,-1.349902,-0.368215,bar,True,NaT
c,NaN,1.171888,0.859315,bar,True,NaT
e,0.995922,0.000268,0.810805,bar,True,2017-12-22
f,0.793222,0.977586,1.770551,bar,True,2017-12-22
h,NaN,-1.056565,1.835253,bar,True,NaT

In [25]:
df2.get_dtype_counts()

bool              1
datetime64[ns]    1
float64           3
object            1
dtype: int64

## Inserting missing data

In [27]:
df2

,one,two,three,four,five,date
a,NaN,-1.349902,-0.368215,bar,True,NaT
c,NaN,1.171888,0.859315,bar,True,NaT
e,0.995922,0.000268,0.810805,bar,True,2017-12-22
f,0.793222,0.977586,1.770551,bar,True,2017-12-22
h,NaN,-1.056565,1.835253,bar,True,NaT

In [30]:
df2.loc['a', 'five'] = None

In [32]:
df2

,one,two,three,four,five,date
a,NaN,-1.349902,-0.368215,bar,NaN,NaT
c,NaN,1.171888,0.859315,bar,1.0,NaT
e,0.995922,0.000268,0.810805,bar,1.0,2017-12-22
f,0.793222,0.977586,1.770551,bar,1.0,2017-12-22
h,NaN,-1.056565,1.835253,bar,1.0,NaT

## Calculations with missing data

NaN's propagate across calculations.

In [35]:
frame1 = df2['two']
frame2 = df2['three']
frame1

a   -1.349902
c    1.171888
e    0.000268
f    0.977586
h   -1.056565
Name: two, dtype: float64

In [36]:
frame2

a   -0.368215
c    0.859315
e    0.810805
f    1.770551
h    1.835253
Name: three, dtype: float64

In [37]:
# Insert some missing values 

frame1.loc['a'] = None
frame2.loc['f'] = None

/ext/anaconda3/lib/python3.5/site-packages/pandas/core/indexing.py:194: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [38]:
frame1

a         NaN
c    1.171888
e    0.000268
f    0.977586
h   -1.056565
Name: two, dtype: float64

In [39]:
frame2

a   -0.368215
c    0.859315
e    0.810805
f         NaN
h    1.835253
Name: three, dtype: float64

In [41]:
frame1 + frame2

a         NaN
c    2.031204
e    0.811073
f         NaN
h    0.778688
dtype: float64

In [42]:
frame1 * frame2

a         NaN
c    1.007022
e    0.000217
f         NaN
h   -1.939064
dtype: float64

In [44]:
# Sums ignore NaNs

frame1.sum()

1.0931766407659047

## Cleaning and filling missing data

In [45]:
df2

,one,two,three,four,five,date
a,NaN,NaN,-0.368215,bar,NaN,NaT
c,NaN,1.171888,0.859315,bar,1.0,NaT
e,0.995922,0.000268,0.810805,bar,1.0,2017-12-22
f,0.793222,0.977586,NaN,bar,1.0,2017-12-22
h,NaN,-1.056565,1.835253,bar,1.0,NaT

In [46]:
# Fill NaNs with a scalar

df2.fillna(0)

,one,two,three,four,five,date
a,0.000000,0.000000,-0.368215,bar,0.0,0
c,0.000000,1.171888,0.859315,bar,1.0,0
e,0.995922,0.000268,0.810805,bar,1.0,2017-12-22 00:00:00
f,0.793222,0.977586,0.000000,bar,1.0,2017-12-22 00:00:00
h,0.000000,-1.056565,1.835253,bar,1.0,0

In [47]:
# This can be a string if the column is string

df2.loc['four', 'e'] = None

In [48]:
df2

,one,two,three,four,five,date,e
a,NaN,NaN,-0.368215,bar,NaN,NaT,NaN
c,NaN,1.171888,0.859315,bar,1.0,NaT,NaN
e,0.995922,0.000268,0.810805,bar,1.0,2017-12-22,NaN
f,0.793222,0.977586,NaN,bar,1.0,2017-12-22,NaN
h,NaN,-1.056565,1.835253,bar,1.0,NaT,NaN
four,NaN,NaN,NaN,NaN,NaN,NaT,NaN

In [49]:
df2.loc['e','four'] = None

In [50]:
df2

,one,two,three,four,five,date,e
a,NaN,NaN,-0.368215,bar,NaN,NaT,NaN
c,NaN,1.171888,0.859315,bar,1.0,NaT,NaN
e,0.995922,0.000268,0.810805,None,1.0,2017-12-22,NaN
f,0.793222,0.977586,NaN,bar,1.0,2017-12-22,NaN
h,NaN,-1.056565,1.835253,bar,1.0,NaT,NaN
four,NaN,NaN,NaN,NaN,NaN,NaT,NaN

In [51]:
df2['four'].fillna('Missing')

a           bar
c           bar
e       Missing
f           bar
h           bar
four    Missing
Name: four, dtype: object

In [52]:
# Reset original DataFrame

df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])

In [53]:
df

,one,two,three
a,-1.330568,-0.712067,1.168101
c,0.155838,1.501229,-1.034452
e,0.585900,0.062052,-1.018777
f,-0.537612,-1.000003,0.933689
h,-0.995782,-1.261540,-1.683496

In [55]:
# Knock out some of the data

df.loc['f':] = None

In [56]:
df

,one,two,three
a,-1.330568,-0.712067,1.168101
c,0.155838,1.501229,-1.034452
e,0.585900,0.062052,-1.018777
f,NaN,NaN,NaN
h,NaN,NaN,NaN

In [58]:
# Fill in the missing data by padding

df3 = df.copy()
df3.fillna(method='pad')

,one,two,three
a,-1.330568,-0.712067,1.168101
c,0.155838,1.501229,-1.034452
e,0.585900,0.062052,-1.018777
f,0.585900,0.062052,-1.018777
h,0.585900,0.062052,-1.018777